HAMA-DL-dev/FT-22/STM32F4/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2022 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stdio.h"
#include "math.h"
#include "stm32f4xx_hal.h"
#include "stdio.h"
#include "string.h"
#include "bno055.h"
#include "bno055_stm32.h"
#include "CANSPI.h"
#include "MCP2515.h"
#include <stdlib.h>
#include "i2c-lcd.h"
#include "stm32_tm1637.h"
#include "i2c.h"
#include "wifi_ubidots.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
#define min(a,b) (((a) < (b)) ? (a) : (b))
#define max(a,b) (((a) > (b)) ? (a) : (b))
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
ADC_HandleTypeDef hadc2;
ADC_HandleTypeDef hadc3;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c3;

SPI_HandleTypeDef hspi2;

UART_HandleTypeDef huart4;
UART_HandleTypeDef huart5;
UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;
UART_HandleTypeDef huart3;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_SPI2_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_UART4_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_UART5_Init(void);
static void MX_ADC1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_ADC3_Init(void);
static void MX_ADC2_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/*
int32_t vADC1;
int32_t vADC2;
int32_t vADC3;
 */

// VALUE :  correlated to battery pack's temperature

#define ADC1_Channel_num 2
int ADCval;

float TempTest;
float Temp;
float Temp_conversion;

float vADC1[ADC1_Channel_num];
float vADC2;
float vADC3;
float Btemp;						// average temperature from 4 ADC to temp value

char buffer[100]=" ";				// buffer to read each battery pack's temperature
char string_temperature[6];			// buffer to send average temperature of 4 battery pack
char string_voltage[6];				// buffer to read each battery pack's voltage

char IMU[100]=" ";

int row;							// row line at LCD
int col;							// column line at LCD

uint8_t receive_data[7];			// received buffer from Arduino Master BMS
float percent_of_batt;				// percentage value of batter voltage

/* VALUE : CANOPEN

uCAN_MSG txMessage;
uCAN_MSG rxMessage;

uint32_t RPM;
float torque;
float temp;

 */

uint8_t Rbuff[100];
uint8_t msg[256];
uint8_t Tbuff[256];
uint8_t TempBuff[256];

void PrintString(uint8_t * string)
{
	HAL_UART_Transmit(&huart2, (uint8_t *)string, strlen((char *)string), 0xffff);
}

// void CANopen(void);
void ADC1_Select_CH0(void);
void ADC1_Select_CH9(void);
float ADCtoTemp(float ADCval);

char str[100]="22 KSAE FOURTOR\r\n";

// char bad[100]="Thermal Protector : DISCONNECTED\r\n";
// char good[100]="Thermal Protector : CONNECTED\r\n";
// char bms[100]="Receive BMS signal from Arudino\r\n";

char BMSbuff[100]="";

/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void)
{
	/* USER CODE BEGIN 1 */

	/* USER CODE END 1 */

	/* MCU Configuration--------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* USER CODE BEGIN Init */

	/* USER CODE END Init */

	/* Configure the system clock */
	SystemClock_Config();

	/* USER CODE BEGIN SysInit */

	/* USER CODE END SysInit */

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_I2C1_Init();
	MX_SPI2_Init();
	MX_USART2_UART_Init();
	MX_UART4_Init();
	MX_USART3_UART_Init();
	MX_UART5_Init();
	MX_ADC1_Init();
	MX_I2C3_Init();
	MX_USART1_UART_Init();
	MX_ADC3_Init();
	MX_ADC2_Init();

	/* USER CODE BEGIN 2 */
	PrintString(str);

//	CANSPI_Initialize();

	lcd_init();
	lcd_clear();
	HAL_Delay(20);
	lcd_put_cur(0,0);
	HAL_Delay(20);
	lcd_send_string((char*)"B.Temp: init");
	lcd_put_cur(1,0);
	HAL_Delay(20);
	lcd_send_string((char*)"B.Vol: init");

	tm1637Init();
	tm1637SetBrightness(5);

	// ------------------------------------ **** IMU Setting ****------------------------------------

	bno055_calibration_data_t calData;
	bno055_assignI2C(&hi2c3);
	bno055_setup();
	bno055_setCalibrationData(calData);//Set init
	bno055_setOperationMode(BNO055_OPERATION_MODE_IMU);//작동 모드
	// bno055_setPowerMode(BNO55_POWER_MODE_LOWPOWER);//파워 모드

	// WifiSetup();

	/* USER CODE END 2 */

	/* Infinite loop */
	/* USER CODE BEGIN WHILE */
	while (1)
	{
		//------------------------------------ **** CANopen Setting ****------------------------------------//

		// CANopen();

		//------------------------------------ **** Temperature sensing ****------------------------------------//

		/* [seki 22] Digital signal pin
		 * Temperature signal using seki 22
		 */

		HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_SET);
		GPIO_PinState PinStat_seg1 = HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_4);

		HAL_GPIO_WritePin(GPIOA, GPIO_PIN_7, GPIO_PIN_SET);
		GPIO_PinState PinStat_seg2 = HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_6);

		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_15, GPIO_PIN_SET);
		GPIO_PinState PinStat_seg3 = HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_14);

