HAMA-DL-dev/FT-22/STM32F4/Core/Src/main.c
		HAL_GPIO_WritePin(GPIOA, GPIO_PIN_12, GPIO_PIN_SET);
		GPIO_PinState PinStat_seg4 = HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_11);

		GPIO_PinState Thermal=(PinStat_seg1&&PinStat_seg2)&&(PinStat_seg3&&PinStat_seg4);

		/*
		GPIO_PinState PinStat=PinStat_seg4;

		if(!PinStat){
			PrintString(bad);
		}
		PrintString(good);
		 */

		/*		[NTC] analog read pin
		 * 		Code for ADC1
		HAL_ADC_Start(&hadc1);
		if(HAL_ADC_PollForConversion(&hadc1, 5)==HAL_OK)
		{
			vADC1 = HAL_ADC_GetValue(&hadc1);
			Btemp = vADC1 * (3.3/4095);
			Btemp = (Btemp *9840)/(3.3-Btemp);

			Btemp = (298.15*3700)/(298.15*log(9840/Btemp)+3700);
			Btemp = Btemp - 273.15;

			sprintf(buffer,"ADC 1 : %.2f \r\n",Btemp);
		}
		if (isnan(Btemp) == 0)
		{
			HAL_UART_Transmit(&huart2,(uint8_t*)buffer,sizeof(buffer),1000);
			HAL_Delay(100);
		}
		*/
		/*

		HAL_ADC_Start(&hadc2);
		if(HAL_ADC_PollForConversion(&hadc2, 5)==HAL_OK)
		{
			vADC2 = HAL_ADC_GetValue(&hadc2);
			vADC2 = vADC2 * (3.3/4095);
			vADC2 = (vADC2 *9840)/(3.3-vADC2);

			vADC2 = (298.15*3700)/(298.15*log(9840/vADC2)+3700);
			vADC2 = vADC2 - 273.15;
		}

		HAL_ADC_Start(&hadc3);
		if(HAL_ADC_PollForConversion(&hadc3, 5)==HAL_OK)
		{
			vADC3 = HAL_ADC_GetValue(&hadc3);
			vADC3 = vADC3 * (3.3/4095);
			vADC3 = (vADC3 *9840)/(3.3-vADC3);

			vADC3 = (298.15*3700)/(298.15*log(9840/vADC3)+3700);
			vADC3 = vADC3 - 273.15;

		}
		sprintf(buffer,"ADC 2 : %.2f \r\n",vADC2);
		if (isnan(vADC1[1]) == 0)
		{
			HAL_UART_Transmit(&huart2,(uint8_t*)buffer,sizeof(buffer),1000);
			HAL_Delay(100);
		}
		*/

		ADC1_Select_CH0();
		HAL_ADC_Start(&hadc1);
		HAL_ADC_PollForConversion(&hadc1,1000);
		vADC1[0]=HAL_ADC_GetValue(&hadc1);
		HAL_ADC_Stop(&hadc1);
		vADC1[0] = ADCtoTemp(vADC1[0]);

		ADC1_Select_CH9();
		HAL_ADC_Start(&hadc1);
		HAL_ADC_PollForConversion(&hadc1,1000);
		vADC1[1]=HAL_ADC_GetValue(&hadc1);
		HAL_ADC_Stop(&hadc1);
		vADC1[1] = ADCtoTemp(vADC1[1]);

		HAL_ADC_Start(&hadc2);
		HAL_ADC_PollForConversion(&hadc2,5);
		vADC2=HAL_ADC_GetValue(&hadc2);
		HAL_ADC_Stop(&hadc2);
		vADC2 = ADCtoTemp(vADC2);

		HAL_ADC_Start(&hadc3);
		HAL_ADC_PollForConversion(&hadc3,5);
		vADC3=HAL_ADC_GetValue(&hadc3);
		HAL_ADC_Stop(&hadc3);
		vADC3 = ADCtoTemp(vADC3);

		Btemp = max(vADC1[0],vADC1[1]);
		Btemp = max(Btemp, vADC2);
		Btemp = max(Btemp, vADC3);

		// sprintf(buffer,"ADC1_CH0 : %.2f \r\nADC1_CH9 : %.2f\r\nADC2_CH1 : %.2f \r\nADC3_CH10: %.2f\r\nMAX: %.2f\r\n\n",vADC1[0],vADC1[1],vADC2,vADC3,Btemp);
		sprintf(buffer,"SEGMENT[1] : %f \r\nSEGMENT[2] : %f\r\nSEGMENT[3] : %f \r\nSEGMENT[4]: %f\r\nMAX: %f\r\n\n",vADC1[0],vADC1[1],vADC2,vADC3,Btemp);
		// PrintString(buffer);

		//------------------------------------ **** Master BMS ****------------------------------------//

		HAL_UART_Receive(&huart3,receive_data,7,200);						// Read Voltage and Celus temperature Data
		// sprintf(string_voltage,"%d.%dV",receive_data[1],receive_data[2]);	//Make String Voltage Data
		// sprintf(string_temperature,"%d'C",receive_data[0]);					//Make String temperature Data
		// HAL_UART_Transmit(&huart2,(char*)receive_data,strlen((char*)receive_data),1000);
		// HAL_UART_Transmit(&huart2,BMSbuff,strlen(BMSbuff),1000);

		// Tester
		/*
		sprintf(BMSbuff,"[1] : %c ",receive_data[0]);
		HAL_UART_Transmit(&huart2,BMSbuff,strlen(BMSbuff),1000);
		sprintf(BMSbuff,"[2] : %c ",receive_data[1]);
		HAL_UART_Transmit(&huart2,BMSbuff,strlen(BMSbuff),1000);
		sprintf(BMSbuff,"[3] : %c ",receive_data[2]);
		HAL_UART_Transmit(&huart2,BMSbuff,strlen(BMSbuff),1000);
		sprintf(BMSbuff,"[4] : %c ",receive_data[3]);
		HAL_UART_Transmit(&huart2,BMSbuff,strlen(BMSbuff),1000);
		sprintf(BMSbuff,"[5] : %c ",receive_data[4]);
		HAL_UART_Transmit(&huart2,BMSbuff,strlen(BMSbuff),1000);
		sprintf(BMSbuff,"[6] : %c ",receive_data[5]);
		HAL_UART_Transmit(&huart2,BMSbuff,strlen(BMSbuff),1000);
		sprintf(BMSbuff,"[7] : %c\n\r",receive_data[6]);
		HAL_UART_Transmit(&huart2,BMSbuff,strlen(BMSbuff),1000);
		HAL_Delay(100);
		*/

		// Transmit voltage value from Arduino
		sprintf(BMSbuff,"%c%c%c%c%c%c",receive_data[0],receive_data[1],receive_data[2],receive_data[3],receive_data[4],receive_data[5]);
		// HAL_UART_Transmit(&huart2,BMSbuff,strlen(BMSbuff),1000);

		//------------------------------------ **** Shut Down Circuit & Over load current shut down ****------------------------------------//

		HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_SET);

		GPIO_PinState StateOfBMS = HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_8);			// rx sig from Arduino
		GPIO_PinState SDC_ON = StateOfBMS && Thermal;

		//  check code for Arduino Uno SDC signal
		/*
		if(StateOfBMS){
			PrintString("BMS STATUS : OK\n\r");
		}
		else{
			PrintString("BMS STATUS : FAULT\n\r");
		}
		 */

		// check code for thermal protector
		/*
		if(Thermal){
			PrintString("THERMAL : OK\n\r");
		}
		else{
			PrintString("THERMAL : FAULT\n\r");
		}
		*/

		if(!SDC_ON)
		{
			// PrintString("SDC activate\n\r");
			HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_RESET);			//  SDC 3output
		}

		//------------------------------------ **** BNO055 IMU sensor ****------------------------------------//
/*
		 bno055_vector_t gyro = bno055_getVectorGyroscope();
		 bno055_vector_t acc = bno055_getVectorAccelerometer();
		 bno055_vector_t v = bno055_getVectorEuler();
		 v = bno055_getVectorQuaternion();

		 sprintf(buffer,"%.2f,%.2f,%.2f\r\n",gyro.x,gyro.y,gyro.z);
		 PrintString(buffer);
		 HAL_Delay(100);
*/
		bno055_vector_t v = bno055_getVectorEuler();
		sprintf(IMU,"Yaw: %.2f Roll: %.2f Pitch: %.2f\r\n", v.x, v.y, v.z);
		PrintString(IMU);
		// v = bno055_getVectorQuaternion();
		// sprintf("W: %.2f X: %.2f Y: %.2f Z: %.2f\r\n", v.w, v.x, v.y, v.z);
		HAL_Delay(100);
		//------------------------------------ **** 7 Segment Setting ****------------------------------------//
		// Before : RPM from motor
		// After  : percentage value from Arduino Master BMS

		float total_v  = atof(BMSbuff);
		percent_of_batt = (double)(total_v - 78.4)*2.55;
		tm1637DisplayDecimal(percent_of_batt,0); // second argument for ":"

