HAMA-DL-dev/FT-22/STM32F4/Core/Src/main.c
}

/* USER CODE BEGIN 4 */
/*
void CANopen(void){
	txMessage.frame.id=0x80;		//0x81
	txMessage.frame.idType=0x00;
	txMessage.frame.dlc=8;
	txMessage.frame.data0=0x00;
	txMessage.frame.data1=0x00;
	txMessage.frame.data2=0x00;
	txMessage.frame.data3=0x00;
	txMessage.frame.data4=0x00;
	txMessage.frame.data5=0x00;
	txMessage.frame.data6=0x00;
	txMessage.frame.data7=0x00;
	CANSPI_Transmit(&txMessage);
	HAL_Delay(50);

	if(CANSPI_Receive(&rxMessage))
	{
		uint16_t RPM_1= ((uint16_t)rxMessage.frame.data1 << 8) | rxMessage.frame.data0;
		uint16_t RPM_2= ((uint16_t)rxMessage.frame.data3 << 8) | rxMessage.frame.data2;
		RPM=	((uint32_t)RPM_2 << 16) | RPM_1;

		// if(torque_buff!=0)PrintString("torque is not zero!\r\n");
		// TX torque doesn't work
		torque= ((uint16_t)rxMessage.frame.data7 << 8) | rxMessage.frame.data6;
		temp= ((uint16_t)rxMessage.frame.data5 << 8) | rxMessage.frame.data4;
		//   	uint16_t torque_buff= ((uint16_t)rxMessage.frame.data5 << 8) | rxMessage.frame.data4;
		//		uint16_t temp_buff= ((uint16_t)rxMessage.frame.data1 << 8) | rxMessage.frame.data0;

		sprintf(Rbuff,"RPM: %ld\r\n",RPM);
		sprintf(Tbuff,"Torque: %.2f \r\n",(float)torque*0.1);
		sprintf(TempBuff,"Temp:%.2f \r\n",temp);

		HAL_UART_Transmit(&huart2, (uint8_t*)Rbuff, sizeof(Rbuff), 100);
		HAL_UART_Transmit(&huart2, (uint8_t*)TempBuff, sizeof(TempBuff), 100);
		HAL_UART_Transmit(&huart2, (uint8_t*)Tbuff, sizeof(Tbuff), 100);

		if(RPM>=1000){
			HAL_UART_Transmit(&huart2, (uint8_t*)"RPM : warning\r\n", sizeof("RPM : warning\r\n"), 100);
		}
		else{
			HAL_UART_Transmit(&huart2, (uint8_t*)"RPM : normal\r\n", sizeof("RPM : normal\r\n"), 100);
		}

		if(temp>=80){
			HAL_UART_Transmit(&huart2, (uint8_t*)"Temperature : over-heat\r\n", sizeof("Temperature : over-heat\r\n"), 100);
		}
		else{
			HAL_UART_Transmit(&huart2, (uint8_t*)"Temperature : normal\r\n", sizeof("Temperature : normal\r\n"), 100);
		}
		HAL_UART_Transmit(&huart2, (uint8_t*)"\n", sizeof("\n"), 100);
		HAL_Delay(1000);
	}
//	else{
//		HAL_UART_Transmit(&huart2, (uint8_t*)"No CAN connection\r\n", sizeof("No CAN connection\r\n"), 100);
//	}
}
 */

void ADC1_Select_CH0(void)
{
	ADC_ChannelConfTypeDef sConfig={0};
	sConfig.Channel = ADC_CHANNEL_0;
	sConfig.Rank = 1;
	sConfig.SamplingTime = ADC_SAMPLETIME_3CYCLES;
	if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
	{
		Error_Handler();
	}
}

void ADC1_Select_CH9(void)
{
	ADC_ChannelConfTypeDef sConfig={0};
	sConfig.Channel = ADC_CHANNEL_9;
	sConfig.Rank = 1;
	sConfig.SamplingTime = ADC_SAMPLETIME_15CYCLES;
	if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
	{
		Error_Handler();
	}
}

float ADCtoTemp(float ADCval){
	float R = (50*100-10*100*ADCval)/ADCval;
	float T = 4073*298/(4073+298*log(R/10000));
	T -= 273.15;
	return T;

	/* Trial 1
	ADCval *= (5.0/4065);
	TempTest = ADCval*(10000/(5.0-ADCval));
	Temp = (1/298.15)+(1/4073)*log(TempTest/10000);
	Temp_conversion = 1/Temp;
	Temp_conversion -= 273.15;

	return Temp_conversion;
	 */
	/* Trial 2
	ADCval =ADCval*(3.3/4095);
	ADCval = (ADCval *9840)/(3.3-ADCval);

	ADCval = (298.15*3700)/(298.15*log(9840/ADCval)+3700);
	ADCval -= 273.15;

	return ADCval;
	 */

	/* Trial 3
		ADCval = (int)ADCval;
		R2 = 10000* (1023.0 / (float)ADCval-1.0);
		logR2 = log(R2);
		T = (1.0 / (c1 + c2*logR2 + c3*logR2*logR2*logR2));
		Tc = T - 273.15;
		Tf = (Tc * 9.0)/5.0 + 32.0;
		return Tc;
	 */

	/* Trial 4
	ADCval =ADCval*(5.0/4095);
	ADCval = (ADCval *9840)/(5.0-ADCval);

	ADCval = (298.15*4073)/(298.15*log(9840/ADCval)+4073);
	ADCval -= 273.15;

	return ADCval;
	*/
}



/* USER CODE END 4 */

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void)
{
	/* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */

	/* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
 * @brief  Reports the name of the source file and the source line number
 *         where the assert_param error has occurred.
 * @param  file: pointer to the source file name
 * @param  line: assert_param error line source number
 * @retval None
 */
void assert_failed(uint8_t *file, uint32_t line)
{
	/* USER CODE BEGIN 6 */
	/* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
	/* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
